JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Sns_DM/Src/AzureClient_mqtt_TM.c
/**
  ******************************************************************************
  * @file    AzureClient_mqtt_TM.c
  * @author  Central LAB
  * @version V3.3.0
  * @date    08-May-2018
  * @brief   Main MQTT application for Telemetry
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#include <stdio.h>
#include <stdlib.h>
#include <stdio.h>
#include "STM32CubeInterface.h"

#ifndef AZURE_IOT_PCS

#include "iothub_client_ll.h"
#include "iothub_message.h"
#include "azure_c_shared_utility/crt_abstractions.h"
#include "azure_c_shared_utility/platform.h"
#include "iothubtransportmqtt.h"
#include "AzureClient_mqtt_TM.h"
#ifdef USE_MBED_TLS
#include "certificates.h"
#endif /* USE_MBED_TLS */
#ifdef AZURE_ENABLE_REGISTRATION
  #include "RegistrationAgent.h"
#endif /* AZURE_ENABLE_REGISTRATION */

#include "serializer.h"
#include "serializer_devicetwin.h"
#include "jsondecoder.h"

#ifdef USE_MBED_TLS
  #include "azure_c_shared_utility/tls_config.h"
  #if !defined(MBEDTLS_CONFIG_FILE)
    #include "mbedtls/config.h"
  #else
    #include MBEDTLS_CONFIG_FILE
  #endif
#endif

/* Connection string containing Hostname, Device Id & Device Key */
char *connectionString = NULL;

DEFINE_ENUM_STRINGS(FIRMWARE_UPDATE_STATUS, FIRMWARE_UPDATE_STATUS_VALUES)


BEGIN_NAMESPACE(AzureModel);

DECLARE_MODEL(Azure1_t,
/* Event data: Temperature, Humidity... */
WITH_DATA(ascii_char_ptr, deviceId),
WITH_DATA(int, messageId),
WITH_DATA(float, Temperature),
WITH_DATA(float, Humidity),
WITH_DATA(float, Pressure),
WITH_DATA(int, accX),
WITH_DATA(int, accY),
WITH_DATA(int, accZ),
WITH_DATA(int, gyrX),
WITH_DATA(int, gyrY),
WITH_DATA(int, gyrZ),
WITH_DATA(int, magX),
WITH_DATA(int, magY),
WITH_DATA(int, magZ),
WITH_DATA(int, HWCounter),
WITH_DATA(ascii_char_ptr, HWOrientation),
WITH_DATA(EDM_DATE_TIME_OFFSET, ts),
/* Methods */
WITH_METHOD(Reboot),
WITH_METHOD(Quit),
/* Commands */
WITH_ACTION(Pause),
WITH_ACTION(Play),
WITH_ACTION(LedOn),
WITH_ACTION(LedOff),
WITH_ACTION(LedBlink),
/* Desired Properties */
#ifndef AZURE_IOT_CENTRAL
WITH_DESIRED_PROPERTY(int, DesiredTelemetryInterval, ChangeTelemetryInterval),
#else /* AZURE_IOT_CENTRAL */
WITH_REPORTED_PROPERTY(ascii_char_ptr_no_quotes, DesiredTelemetryInterval),
#endif /* AZURE_IOT_CENTRAL */
WITH_DESIRED_PROPERTY(int, DesiredHWMode, ChangeHWMode),
/* Reported Properties */
/* Register Commands with IoT Hub */
WITH_REPORTED_PROPERTY(ascii_char_ptr_no_quotes, SupportedCommands),
/* Register Direct Methods with IoT Hub */
WITH_REPORTED_PROPERTY(ascii_char_ptr_no_quotes, SupportedMethods),
/* Telemetry Interval in Seconds... value from 1 to: 0xFFFF/2000 = About 30 Seconds */
WITH_REPORTED_PROPERTY(int,TelemetryInterval),
WITH_REPORTED_PROPERTY(ascii_char_ptr,AzureStatus),
WITH_REPORTED_PROPERTY(int, ActiveHWMode),
WITH_REPORTED_PROPERTY(ascii_char_ptr, AzureFwVersion)
);

END_NAMESPACE(AzureModel);

Azure1_t *Azure1;

typedef struct EVENT_INSTANCE_TAG
{
  IOTHUB_MESSAGE_HANDLE messageHandle;
  size_t messageTrackingId;  // For tracking the messages within the user callback.
  void *this;  // For Memory management (free)
} EVENT_INSTANCE;

IOTHUB_CLIENT_LL_HANDLE iotHubClientHandle;

#define AZURE_LED_MODE \
  AZURE_LED_ON, \
  AZURE_LED_OFF, \
  AZURE_LED_BLINK
DEFINE_ENUM(AZURE_LED, AZURE_LED_MODE)


static bool g_continueRunning;
static bool g_reboot     = false;
static AZURE_LED LedMode = AZURE_LED_BLINK;
/* Counters for Sent/Received Status */
static size_t StatusBackCount = 0;
static size_t SentStatusCount = 0;
/* Counters for Sent/Received Messages */
static size_t MessagesBackCount = 0;
static size_t SentMessagesCount = 0;

static volatile int32_t ReceivedDeviceTwinProperty=0;

uint32_t HWEventCounter[5] = {0 /* FreeFall */,
                              0 /* Single Tap */,
                              0 /* Double Tap */,
                              0 /* Wake Up */,
                              0 /* Tilt */};

static void SendSNSData(void);

static void Send6DOrientationData(void);

static EDM_DATE_TIME_OFFSET GetDateTimeOffset(time_t time)
{
  struct tm *newTime;
  EDM_DATE_TIME_OFFSET dateTimeOffset;
  newTime = gmtime(&time);
  dateTimeOffset.dateTime = *newTime;
  dateTimeOffset.fractionalSecond = 0;
  dateTimeOffset.hasFractionalSecond = 0;
  dateTimeOffset.hasTimeZone = 0;
  dateTimeOffset.timeZoneHour = 0;
  dateTimeOffset.timeZoneMinute = 0;
  return dateTimeOffset;
}

