JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Sns_DM/Src/AzureClient_mqtt_TM.c
#ifdef AZURE_IOT_CENTRAL
static void DeviceTwinCallback(int status_code, void* userContextCallback);
static int32_t DesiredTelemetryInterval =1;
static int32_t DesiredVersion =1;
#endif /* AZURE_IOT_CENTRAL */

/* Handles for Commands */

/**
 * @brief Implementation of Pause Command
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval EXECUTE_COMMAND_RESULT Command Result
 */
EXECUTE_COMMAND_RESULT Pause(Azure1_t *Azure1)
{
  (void)(Azure1);
  AZURE_PRINTF("Received Pause command\r\n");
  StopTimer1();
  return EXECUTE_COMMAND_SUCCESS;
}

/**
 * @brief Implementation of Play Command
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval EXECUTE_COMMAND_RESULT Command Result
 */
EXECUTE_COMMAND_RESULT Play(Azure1_t *Azure1)
{
  (void)(Azure1);
  AZURE_PRINTF("Received Play command\r\n");
  StartTimer1();
  return EXECUTE_COMMAND_SUCCESS;
}

/**
 * @brief Implementation of LedOn Command
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval EXECUTE_COMMAND_RESULT Command Result
 */
EXECUTE_COMMAND_RESULT LedOn(Azure1_t *Azure1)
{
  (void)(Azure1);
  AZURE_PRINTF("Received LedOn command\r\n");
  LedMode = AZURE_LED_ON;
  BSP_LED_On(LED2);
  return EXECUTE_COMMAND_SUCCESS;
}

/**
 * @brief Implementation of LedOff Command
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval EXECUTE_COMMAND_RESULT Command Result
 */
EXECUTE_COMMAND_RESULT LedOff(Azure1_t *Azure1)
{
  (void)(Azure1);
  AZURE_PRINTF("Received LedOff command\r\n");
  LedMode = AZURE_LED_OFF;
  BSP_LED_Off(LED2);
  return EXECUTE_COMMAND_SUCCESS;
}

/**
 * @brief Implementation of LedBlink Command
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval EXECUTE_COMMAND_RESULT Command Result
 */
EXECUTE_COMMAND_RESULT LedBlink(Azure1_t *Azure1)
{
  (void)(Azure1);
  AZURE_PRINTF("Received LedBlink command\r\n");
  LedMode = AZURE_LED_BLINK;
  return EXECUTE_COMMAND_SUCCESS;
}

/* Handles for direct methods */

/**
 * @brief Implementation of Reboot Direct Method
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval METHODRETURN_HANDLE Direct Method Result
 */
METHODRETURN_HANDLE Reboot(Azure1_t *Azure1)
{
  (void)(Azure1);
  METHODRETURN_HANDLE result = MethodReturn_Create(201, "\"Rebooting\"");
  AZURE_PRINTF("Received Reboot request\r\n");
  g_reboot = true;
  return result;
}

/**
 * @brief Implementation of Quit Direct Method
 * @param Azure1_t *Azure1 Pointer to the Model instance
 * @retval METHODRETURN_HANDLE Direct Method Result
 */
METHODRETURN_HANDLE Quit(Azure1_t *Azure1)
{
  (void)(Azure1);
  METHODRETURN_HANDLE result = MethodReturn_Create(201,  "\"I will stop\"");
  g_continueRunning = false;
  AZURE_PRINTF("Received Quit request\r\n");
  return result;
}

/* Handle for Desired Properties */

/**
 * @brief Function for changing the Telemetry Interval
 * @param void *argument Pointer to the Model instance
 * @retval None
 */
void ChangeTelemetryInterval(void* argument)
{
  Azure1_t *Azure = argument;
#ifndef AZURE_IOT_CENTRAL
  if((Azure1->DesiredTelemetryInterval>0) & (Azure1->DesiredTelemetryInterval<=30)){
    Azure1->TelemetryInterval = Azure1->DesiredTelemetryInterval;
    TargetBoardFeatures.TIM_CC1_Pulse = Azure1->DesiredTelemetryInterval*2000 /* 2Hz Timer Frequency */;
#else /* AZURE_IOT_CENTRAL */
  if((DesiredTelemetryInterval>0) & (DesiredTelemetryInterval<=30)){
    Azure1->TelemetryInterval = DesiredTelemetryInterval;
    TargetBoardFeatures.TIM_CC1_Pulse = DesiredTelemetryInterval*2000 /* 2Hz Timer Frequency */;
#endif /* AZURE_IOT_CENTRAL */
    ReportState(Running);
  } else {
#ifndef AZURE_IOT_CENTRAL
    AZURE_PRINTF("Err: Received a Not Allowed desired Telemetry Interval=%d (1<=Allowed<=30)\r\n",Azure->DesiredTelemetryInterval);
#else /* AZURE_IOT_CENTRAL */
    AZURE_PRINTF("Err: Received a Not Allowed desired Telemetry Interval=%d (1<=Allowed<=30)\r\n",DesiredTelemetryInterval);
#endif /* AZURE_IOT_CENTRAL */
  }
}

/**
 * @brief Function for changing the HW Mode
 * @param void *argument Pointer to the Model instance
 * @retval None
 */
void ChangeHWMode(void* argument)
{
  Azure1_t *Azure = argument;
  if((Azure1->DesiredHWMode>0) & (Azure1->DesiredHWMode<8)){
    switch(Azure1->DesiredHWMode) {
      case 1:
        EnableHWPedometer();
        Azure1->HWCounter = GetStepHWPedometer();
      break;
      case 2:
        EnableHWFreeFall();
        Azure1->HWCounter = HWEventCounter[0];
      break;
      case 3:
        EnableHWSingleTap();
        Azure1->HWCounter = HWEventCounter[1];
      break;
      case 4:
        EnableHWDoubleTap();
        Azure1->HWCounter = HWEventCounter[2];
      break;
      case 5:
        EnableHWWakeUp();
        Azure1->HWCounter = HWEventCounter[3];
      break;
      case 6:
        EnableHWTilt();
        Azure1->HWCounter = HWEventCounter[4];
      break;
      case 7:
        EnableHWOrientation6D();
        Azure1->HWCounter =0; /* Not Used for 6D Orientation */
      break;
    }
    /* Change the Active HW Mode */
    Azure->ActiveHWMode = Azure->DesiredHWMode;
    ReportState(Running);
  } else {
    AZURE_PRINTF("Err: Received a Not Allowed desired HW mode=%d (1<=Allowed<=7)\r\n",Azure->DesiredHWMode);
  }
}

/**
  * @brief  Fill the Model Instance(date, sensors data)
  * @param  None
  * @retval None
  */
static void FillTheModelInstance(void)
{
  time_t now;
  float SensorValueT;
  float SensorValueH;
  float SensorValueP;
  uint8_t Status;
  SensorAxes_t ACC_Value;
  SensorAxes_t GYR_Value;
  SensorAxes_t MAG_Value;

  /* Read or Emulate the Sensors */
  if(!TargetBoardFeatures.EmulateSns) {
    if(BSP_TEMPERATURE_IsInitialized(TargetBoardFeatures.HandleTempSensors[0],&Status)==COMPONENT_OK){
      BSP_TEMPERATURE_Get_Temp(TargetBoardFeatures.HandleTempSensors[0],(float *)&SensorValueT);
    }

    if(TargetBoardFeatures.HandleHumSensor) {
      if(BSP_HUMIDITY_IsInitialized(TargetBoardFeatures.HandleHumSensor,&Status)==COMPONENT_OK){
        BSP_HUMIDITY_Get_Hum(TargetBoardFeatures.HandleHumSensor,(float *)&SensorValueH);
      }
    }

    if(TargetBoardFeatures.HandlePressSensor) {
      if(BSP_PRESSURE_IsInitialized(TargetBoardFeatures.HandlePressSensor,&Status)==COMPONENT_OK){
        BSP_PRESSURE_Get_Press(TargetBoardFeatures.HandlePressSensor,(float *)&SensorValueP);
      }
    }

