JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Sns_DM/Src/AzureClient_mqtt_TM.c
#ifdef AZURE_IOT_CENTRAL
    /* We need to answer with one reported property with the same name of the desired one */
    {
      JSON_Value *root_value = json_value_init_object();
      JSON_Object *root_object = json_value_get_object(root_value);
      json_object_dotset_number(root_object, "value", Azure1->TelemetryInterval);
      json_object_dotset_number(root_object, "desiredVersion", DesiredVersion);
      json_object_dotset_string(root_object, "status", "completed");
      json_object_dotset_string(root_object, "message", "Processed");
      Azure1->DesiredTelemetryInterval = json_serialize_to_string_pretty(root_value);
      json_value_free(root_value);
    }
#endif /* AZURE_IOT_CENTRAL */

  /*serialize the model using SERIALIZE_REPORTED_PROPERTIES */
  if (SERIALIZE_REPORTED_PROPERTIES(&buffer, &bufferSize, *Azure1) != CODEFIRST_OK) {
    AZURE_PRINTF("Err: Serializing Reported State\r\n");
  } else {
    /* send the data up stream*/
    //AZURE_PRINTF("Buffer for Reported Property... %s\r\n",buffer);
    if(IoTHubClient_LL_SendReportedState(iotHubClientHandle, buffer, bufferSize, DeviceTwinCallback, NULL)!= IOTHUB_CLIENT_OK) {
      AZURE_PRINTF("Err: Failure Sending Reported State\r\n");
    } else {
      SentStatusCount++;
      AZURE_PRINTF("Ok reported State [%d]: %s\r\n", SentStatusCount,Azure1->AzureStatus);
    }
    free(buffer);
  }
}

/* @brief Callback called when one C2D message is received
 * @param IOTHUB_MESSAGE_HANDLE message Pointer to the received message
 * @param void* userContextCallback pointer to the model instance
 * @retval IOTHUBMESSAGE_DISPOSITION_RESULT Results of the messagge (Abandoned/Accepted/...)
 */
static IOTHUBMESSAGE_DISPOSITION_RESULT ReceiveMessageCallback(IOTHUB_MESSAGE_HANDLE message, void* userContextCallback)
{
  IOTHUBMESSAGE_DISPOSITION_RESULT result;
  const unsigned char* buffer;
  size_t size;
  if (IoTHubMessage_GetByteArray(message, &buffer, &size) != IOTHUB_MESSAGE_OK){
    AZURE_PRINTF("unable to retrieve the message data\r\n");
    result = IOTHUBMESSAGE_ABANDONED;
  } else {
    /*buffer is not zero terminated*/
    char* temp = malloc(size + 1);
    if (temp == NULL) {
      AZURE_PRINTF("Err: failed to malloc\r\n");
      result = IOTHUBMESSAGE_ABANDONED;
    } else {
      EXECUTE_COMMAND_RESULT executeCommandResult;

      AZURE_PRINTF("Received Message with Data: <<<%.*s>>> & Size=%d\r\n", (int)size, buffer, (int)size);

      (void)memcpy(temp, buffer, size);
      temp[size] = '\0';
      executeCommandResult = EXECUTE_COMMAND(userContextCallback, temp);
      result =
          (executeCommandResult == EXECUTE_COMMAND_ERROR) ? IOTHUBMESSAGE_ABANDONED :
          (executeCommandResult == EXECUTE_COMMAND_SUCCESS) ? IOTHUBMESSAGE_ACCEPTED :
          IOTHUBMESSAGE_REJECTED;
      free(temp);
    }
  }
  return result;
}

/* @brief Callback received when a message is received from IoT
 * @param IOTHUB_CLIENT_CONFIRMATION_RESULT result confirmation result from IoTs
 * @param void* userContextCallback pointer to event instance
 * @retval None
 */
static void SendConfirmationCallback(IOTHUB_CLIENT_CONFIRMATION_RESULT result, void* userContextCallback)
{
  EVENT_INSTANCE* eventInstance = (EVENT_INSTANCE*)userContextCallback;

  AZURE_PRINTF("Confirmation received for message [%d] with result = %s\r\n", eventInstance->messageTrackingId, ENUM_TO_STRING(IOTHUB_CLIENT_CONFIRMATION_RESULT, result));
  MessagesBackCount++;
  free(eventInstance->this);
}

/**
  * @brief  Send Sensors' Data to IoT Hub
  * @param  None
  * @retval None
  */
static void SendSNSData(void)
{
  EVENT_INSTANCE *messages;
  unsigned char* destination;
  size_t destinationSize;

  /* Read the Data from the Sensors */
  FillTheModelInstance();

  messages = (EVENT_INSTANCE *) calloc(1,sizeof(EVENT_INSTANCE));
  if(messages==NULL) {
    AZURE_PRINTF("Err: Allocating Memory for messages to IoT Hub\r\n");
    while(1) {
      ;
    }
  } else {
    messages->this = (void *)messages;
  }

  SentMessagesCount++;
  Azure1->messageId = messages->messageTrackingId = SentMessagesCount;

  if (SERIALIZE(&destination, &destinationSize,
                Azure1->deviceId, Azure1->messageId,
                Azure1->Temperature, Azure1->Humidity, Azure1->Pressure,
                Azure1->accX , Azure1->accY, Azure1->accZ,
                Azure1->gyrX , Azure1->gyrY, Azure1->gyrZ,
                Azure1->magX , Azure1->magY, Azure1->magZ,
                Azure1->HWCounter,
                Azure1->ts) != CODEFIRST_OK){
    AZURE_PRINTF("Err: Failed to serialize\r\n");
    while(1) {
      ;
    }
  }

  /* Only for Debug */
  //AZURE_PRINTF("MessageToSend=%.*s\r\n",destinationSize,destination);

  if ((messages->messageHandle = IoTHubMessage_CreateFromByteArray(destination, destinationSize)) == NULL) {
    AZURE_PRINTF("Err: iotHubMessageHandle is NULL!\r\n");
  } else {
    char msgText[32];
    MAP_HANDLE propMap = IoTHubMessage_Properties(messages->messageHandle);
    sprintf_s(msgText, sizeof(msgText), "PropMsg_%zu", SentMessagesCount);
    if (Map_AddOrUpdate(propMap, "PropName", msgText) != MAP_OK){
      AZURE_PRINTF("Err: Map_AddOrUpdate Failed!\r\n");
    }
    if (IoTHubClient_LL_SendEventAsync(iotHubClientHandle, messages->messageHandle, SendConfirmationCallback, messages) != IOTHUB_CLIENT_OK) {
      AZURE_PRINTF("Err: IoTHubClient_LL_SendEventAsync..........FAILED!\r\n");
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SendEventAsync accepted message [%d] for transmission to IoT Hub.\r\n", SentMessagesCount);
    }
    free(destination);
  }
  IoTHubMessage_Destroy(messages->messageHandle);
}

/**
  * @brief  Send 6D Orientation to IoT Hub
  * @param  None
  * @retval None
  */
static void Send6DOrientationData(void)
{
  EVENT_INSTANCE *messages;
  unsigned char* destination;
  size_t destinationSize;
  time_t now;

  messages = (EVENT_INSTANCE *) calloc(1,sizeof(EVENT_INSTANCE));
  if(messages==NULL) {
    AZURE_PRINTF("Err: Allocating Memory for messages to IoT Hub\r\n");
    while(1) {
      ;
    }
  } else {
    messages->this = (void *)messages;
  }

  SentMessagesCount++;
  Azure1->messageId = messages->messageTrackingId = SentMessagesCount;

