JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Sns_DM/Src/AzureClient_mqtt_TM.c
  /* Read the Time  from RTC */
  now = TimingSystemGetSystemTime();
  /* Time Stamp */
  Azure1->ts = GetDateTimeOffset(now);

  if (SERIALIZE(&destination, &destinationSize,
                Azure1->deviceId, Azure1->messageId,
                Azure1->HWOrientation,
                Azure1->ts) != CODEFIRST_OK){
    AZURE_PRINTF("Err: Failed to serialize\r\n");
    while(1) {
      ;
    }
  }

  /* Only for Debug */
  //AZURE_PRINTF("MessageToSend=%.*s\r\n",destinationSize,destination);

  if ((messages->messageHandle = IoTHubMessage_CreateFromByteArray(destination, destinationSize)) == NULL) {
    AZURE_PRINTF("Err: iotHubMessageHandle is NULL!\r\n");
  } else {
    char msgText[32];
    MAP_HANDLE propMap = IoTHubMessage_Properties(messages->messageHandle);
    sprintf_s(msgText, sizeof(msgText), "PropMsg_%zu", SentMessagesCount);
    if (Map_AddOrUpdate(propMap, "PropName", msgText) != MAP_OK){
      AZURE_PRINTF("Err: Map_AddOrUpdate Failed!\r\n");
    }
    if (IoTHubClient_LL_SendEventAsync(iotHubClientHandle, messages->messageHandle, SendConfirmationCallback, messages) != IOTHUB_CLIENT_OK) {
      AZURE_PRINTF("Err: IoTHubClient_LL_SendEventAsync..........FAILED!\r\n");
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SendEventAsync accepted message [%d] for transmission to IoT Hub.\r\n", SentMessagesCount);
    }
    free(destination);
  }
  IoTHubMessage_Destroy(messages->messageHandle);
}

/**
  * @brief  Callback for user button
  * @param  None
  * @retval None
  */
static void ButtonCallback(void)
{
  AZURE_PRINTF("Button Pressed\r\n");
  g_continueRunning = false;
}

/**
  * @brief  Function for waiting that the IoT has received all the messages/status sent
  * @param  None
  * @retval None
  */
void WaitAllTheMessages(void)
{
  /* Wait All the Reported State/Message confirmation */
  while((StatusBackCount<SentStatusCount) | (MessagesBackCount<SentMessagesCount)) {
    IoTHubClient_LL_DoWork(iotHubClientHandle);
    HAL_Delay(10);
  }
}

/**
  * @brief  Main MQTT application for Telemetry
  * @param  None
  * @retval None
  */
void AzureClient_mqtt_TM(void)
{
  if (platform_init() != 0){
    AZURE_PRINTF("Failed to initialize the platform.\r\n");
    AzureExit(AZURE_ERR_PLATFORM_INIT);
  } else {
    char MAC_RegisterdAddress[13];
    g_continueRunning = true;
    AZURE_PRINTF("Platform Init Done\r\n");
#ifdef AZURE_IOT_CENTRAL
    AZURE_PRINTF("Azure IoT Central\r\n");
#endif /* AZURE_IOT_CENTRAL */
    {
        int32_t Read;
        int32_t Write=0;
        for(Read=0;Read<17;Read++) {
          if(macaddstart[Read]!=':') {
            MAC_RegisterdAddress[Write] = macaddstart[Read];
            Write++;
          }
          MAC_RegisterdAddress[Write]='\0'; // Termination
        }
      }

    /* Led on for signaling the end of Platform init phase */
    BSP_LED_On(LED2);

    if (serializer_init(NULL) != SERIALIZER_OK) {
      AZURE_PRINTF("Err: Unable to Initialize Serializer\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    }
    AZURE_PRINTF("Serializer Initialized\r\n");

#ifdef AZURE_ENABLE_REGISTRATION
    /* Board Registration Procedure */
    if(RegistrationAgent(&connectionString)!=0) {
      AZURE_PRINTF("Err: During Board Registration\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      sURI_Info URI = { URI_ID_0x04_STRING, "\0", "\0"};
      AZURE_PRINTF("Board Registration Done\r\n\r\n");

      /* If NFC is present */
      if(TargetBoardFeatures.NFCInitialized ) {
        sprintf(URI.URI_Message,"%s/Home/Index/%s\r\n\r\n",WEB_DASHBOARD_URL, MAC_RegisterdAddress);
        while (NDEF_WriteURI(&URI) != NDEF_OK) {
          ;
        }
        AZURE_PRINTF("Read the NFC or Connect to:\r\n");
      } else {
        AZURE_PRINTF("Connect to:\r\n");
      }
      AZURE_PRINTF("https://%s/Home/Index/%s\r\n\r\n",WEB_DASHBOARD_URL, MAC_RegisterdAddress);
    }
#else /* AZURE_ENABLE_REGISTRATION */
    if(connectionString==NULL) {
      AZURE_PRINTF("Err: connectionString is NULL!\r\n");
      AZURE_PRINTF("\tSet AZUREDEVICECONNECTIONSTRING in azure1_config.h file or via serial terminal.\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    }
#endif /* AZURE_ENABLE_REGISTRATION */

    if((iotHubClientHandle = IoTHubClient_LL_CreateFromConnectionString(connectionString, MQTT_Protocol)) == NULL){
      AZURE_PRINTF("Err: iotHubClientHandle is NULL!\r\n");
      AZURE_PRINTF("\tchange AZUREDEVICECONNECTIONSTRING on Inc/azure1_config.h file\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("iotHubClientHandle Created\r\n");
    }

    {
      bool traceOn = true;
      if(IoTHubClient_LL_SetOption(iotHubClientHandle, "logtrace", &traceOn)==IOTHUB_CLIENT_OK) {
        AZURE_PRINTF("iotHubClientSetOption logtrace Ok\r\n");
      }
    }

    Azure1 = CREATE_MODEL_INSTANCE(AzureModel, Azure1_t);
    if (Azure1 == NULL){
      AZURE_PRINTF("Err: Creating the Model Instance\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("Model Instance Created\r\n");
    }

    /* Allocate Space for storing Board ID */
    Azure1->deviceId = (char *) calloc(16,1);
    if(Azure1->deviceId==NULL) {
      AZURE_PRINTF("Err Allocating memory\r\n\tFile %s Line %d\r\n",__FILE__, __LINE__);
      AzureExit(AZURE_ERR_MALLOC);
    }

    /* Allocate Space for storing Device Status */
    Azure1->AzureStatus = (char *) calloc(16,1);
    if(Azure1->AzureStatus==NULL) {
      AZURE_PRINTF("Err Allocating memory\r\n\tFile %s Line %d\r\n",__FILE__, __LINE__);
      AzureExit(AZURE_ERR_MALLOC);
    }

    /* Allocate Space for storing Device Firmware Version */
    Azure1->AzureFwVersion = (char *) calloc(64,1);
    if(Azure1->AzureFwVersion==NULL) {
      AZURE_PRINTF("Err Allocating memory\r\n\tFile %s Line %d\r\n",__FILE__, __LINE__);
      AzureExit(AZURE_ERR_MALLOC);
    }

    /* Allocate Space for storing the HW orientation */
    Azure1->HWOrientation = (char *) calloc(16,1);
    if(Azure1->HWOrientation==NULL) {
      AZURE_PRINTF("Err Allocating memory\r\n\tFile %s Line %d\r\n",__FILE__, __LINE__);
      AzureExit(AZURE_ERR_MALLOC);
    }
    sprintf(Azure1->HWOrientation,"%s","Unknowed");

