JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Sns_DM/Src/AzureClient_mqtt_TM.c
    /* Supported Methods */
    Azure1->SupportedMethods = "{\"Reboot\": \"Reboot the device\",\
                                 \"Quit\": \"Stop the trasmission\"}";
    /* Supported Commands */
    Azure1->SupportedCommands = "{\"Pause\": \"Pause Sensors' Data trasmission\",\
                                 \"Play\": \"Resume Sensors' Data trasmission\",\
                                 \"LedOn\": \"Switch On the User Led\",\
                                 \"LedOff\": \"Switch Off the User Led\",\
                                 \"LedBlink\": \"Blinking User Led for every Sensor's Data trasmission\"}";

    /* Fixed Data Fields an reported Properties */
    sprintf(Azure1->AzureFwVersion,"%s V%c.%c.%c SDK=%s", AZURE_PACKAGENAME,
            AZURE_VERSION_MAJOR,AZURE_VERSION_MINOR,AZURE_VERSION_PATCH,IOTHUB_SDK_VERSION);
    /* Board Identification */
    sprintf(Azure1->deviceId,"%s",MAC_RegisterdAddress);

    /* Telemetry Intervall */
    Azure1->TelemetryInterval = TargetBoardFeatures.TIM_CC1_Pulse/2000 /* 2Hz Timer Frequency */;


    /* Active HW Mode == FreeFall */
    Azure1->ActiveHWMode = 2;

    /* Setting Message call back, so we can receive Commands. */
    if (IoTHubClient_LL_SetMessageCallback(iotHubClientHandle, ReceiveMessageCallback, Azure1) != IOTHUB_CLIENT_OK){
      AZURE_PRINTF("Err: IoTHubClient_LL_SetMessageCallback..........FAILED!\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SetMessageCallback...successful.\r\n");
    }

    if(IoTHubClient_LL_SetDeviceMethodCallback(iotHubClientHandle, deviceMethodCallback, Azure1) != IOTHUB_CLIENT_OK){
      AZURE_PRINTF("Err: IoTHubClient_LL_SetDeviceMethodCallback..........FAILED!\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SetDeviceMethodCallback...successful.\r\n");
    }

#ifdef USE_MBED_TLS
    /* Load certificates */
    if (IoTHubClient_LL_SetOption(iotHubClientHandle, "TrustedCerts", certificates) != IOTHUB_CLIENT_OK ) {
      AZURE_PRINTF("Err: IoTHubClient_LL_SetOption(certificates)..........FAILED!\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SetOption(certificates)...successful.\r\n");
    }
#endif  /* USE_MBED_TLS */

    if(IoTHubClient_LL_SetDeviceTwinCallback(iotHubClientHandle, DeviceTwinCallbackStatus, Azure1) != IOTHUB_CLIENT_OK){
      AZURE_PRINTF("Err: IoTHubClient_LL_SetDeviceTwinCallback..........FAILED!\r\n");
      AzureExit(AZURE_ERR_IOT_START);
    } else {
      AZURE_PRINTF("IoTHubClient_LL_SetDeviceTwinCallback...successful.\r\n");
    }

    /* Wait the Answer from IOT */
    while(ReceivedDeviceTwinProperty==0){
      IoTHubClient_LL_DoWork(iotHubClientHandle);
      HAL_Delay(100);
    }

    /* Led off for signaling the end IOT connection procedure */
    BSP_LED_Off(LED2);

    Azure1->HWCounter =0;

    StartTimer1();

    ReportState(Running);

    /* Now that we are ready to receive commands and send messages */
    while(g_continueRunning) {
      /* Handle Interrupt from MEMS */
      if(MEMSInterrupt) {
        uint32_t HWFeaturesAnswer;
        HWFeaturesAnswer = MEMSCallback();
        MEMSInterrupt=0;

        if(HWFeaturesAnswer!=ACC_NOT_USED) {
          switch(Azure1->ActiveHWMode) {
            case 1:
              /* Pedometer */
              Azure1->HWCounter = HWFeaturesAnswer;
            break;
            case 2:
              /* Free Fall */
            case 3:
              /* * Single Tap */
            case 4:
              /* * Double Tap */
            case 5:
              /* Wake Up */
            case 6:
              /* Tilt */
              HWEventCounter[Azure1->ActiveHWMode-2]++;
              Azure1->HWCounter = HWEventCounter[Azure1->ActiveHWMode-2];
            break;
            case 7:
              /* If we had enabled the 6D orientation HW feature */
              switch(HWFeaturesAnswer) {
                case ACC_6D_OR_TOP:
                  sprintf(Azure1->HWOrientation,"%s","Top");
                break;
                case ACC_6D_OR_LEFT:
                  sprintf(Azure1->HWOrientation,"%s","Left");
                break;
                case ACC_6D_OR_BOTTOM:
                  sprintf(Azure1->HWOrientation,"%s","Bottom");
                break;
                case ACC_6D_OR_RIGTH:
                  sprintf(Azure1->HWOrientation,"%s","Right");
                break;
                case ACC_6D_OR_UP:
                  sprintf(Azure1->HWOrientation,"%s","Up");
                break;
                case ACC_6D_OR_DOWN:
                  sprintf(Azure1->HWOrientation,"%s","Down");
                break;
              }
              Send6DOrientationData();
            break;
          }
        }
      }

      /* Handle user button */
      if(ButtonPressed) {
        ButtonCallback();
        ButtonPressed=0;
      }

      /* Environmental Data */
      if(SendData) {
        SendData=0;
        /* Led Toggle */
        if(LedMode == AZURE_LED_BLINK) {
          BSP_LED_Toggle(LED2);
        }
        SendSNSData();
      }

      /* Reboot System */
      if(g_reboot) {
        g_reboot = false;
        ReportState(Rebootting);
        WaitAllTheMessages();
        AZURE_PRINTF("Call to HAL_NVIC_SystemReset\r\n");
        HAL_NVIC_SystemReset();
      }
      IoTHubClient_LL_DoWork(iotHubClientHandle);
    }

    StopTimer1();

    AZURE_PRINTF("iothub_client_sample_mqtt has gotten quit message\r\n");

    ReportState(Ended);

    WaitAllTheMessages();

    free(Azure1->deviceId);
    free(Azure1->AzureStatus);
    free(Azure1->AzureFwVersion);
    free(Azure1->HWOrientation);

    DESTROY_MODEL_INSTANCE(Azure1);

    IoTHubClient_LL_Destroy(iotHubClientHandle);
    AZURE_PRINTF("iotHubClientHandle Destroied\r\n");

    serializer_deinit();
    platform_deinit();
    AZURE_PRINTF("Platform DeInit\r\n");
  }
}


#ifdef MBEDTLS_ENTROPY_HARDWARE_ALT

#include "mbedtls/entropy_poll.h"
/**
  * @brief Function for initializing the Random Generator
  * @param void* Data
  * @param unsigned char* Output
  * @param size_t Len Lenght of the Input
  * @param size_t* oLen Lenght of the Output
  * @retval int ok/error (0/-1)
  */
int mbedtls_hardware_poll( void *Data, unsigned char *Output, size_t Len, size_t *oLen )
{
  uint32_t index;
  uint32_t randomValue;
		
  for (index = 0; index < Len/4; index++) {
    if (randomValue=rand()) {
      *oLen += 4;
      memset(&(Output[index * 4]), (int)randomValue, 4);
    } else {
      AZURE_PRINTF("Err random number\r\n");
      return -1;
    }
  }
  return 0;
}

#endif /* MBEDTLS_ENTROPY_HARDWARE_ALT */

#endif /* AZURE_IOT_PCS */

/******************* (C) COPYRIGHT 2018 STMicroelectronics *****END OF FILE****/
